---
kind: method
id: M:Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/674071b4-4457-91e6-9e07-ad94df7bd4d8.htm
---
# Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.